{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 192], "input_dtype": "int32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 422], "input_dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_2", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 10000, "batch_input_shape": [null, 192], "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "dropout": 0.5, "output_dim": 300, "input_length": 192}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "embedding_2"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 30000, "batch_input_shape": [null, 422], "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "dropout": 0.5, "output_dim": 300, "input_length": 422}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 1, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "convolution1d_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_5", "activity_regularizer": null, "trainable": true, "filter_length": 2, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "convolution1d_5"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_6", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "convolution1d_6"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 1, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 2, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 333, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "MaxPooling1D", "config": {"stride": 192, "pool_length": 192, "trainable": true, "name": "maxpooling1d_4", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "maxpooling1d_4"}, {"class_name": "MaxPooling1D", "config": {"stride": 191, "pool_length": 191, "trainable": true, "name": "maxpooling1d_5", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_5", 0, 0]]], "name": "maxpooling1d_5"}, {"class_name": "MaxPooling1D", "config": {"stride": 190, "pool_length": 190, "trainable": true, "name": "maxpooling1d_6", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_6", 0, 0]]], "name": "maxpooling1d_6"}, {"class_name": "MaxPooling1D", "config": {"stride": 422, "pool_length": 422, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "maxpooling1d_1"}, {"class_name": "MaxPooling1D", "config": {"stride": 421, "pool_length": 421, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "maxpooling1d_2"}, {"class_name": "MaxPooling1D", "config": {"stride": 420, "pool_length": 420, "trainable": true, "name": "maxpooling1d_3", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "maxpooling1d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["maxpooling1d_4", 0, 0]]], "name": "flatten_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}, "inbound_nodes": [[["maxpooling1d_5", 0, 0]]], "name": "flatten_5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}, "inbound_nodes": [[["maxpooling1d_6", 0, 0]]], "name": "flatten_6"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "flatten_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "flatten_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "flatten_3"}, {"class_name": "Merge", "config": {"name": "summary_activations", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["flatten_4", 0, 0], ["flatten_5", 0, 0], ["flatten_6", 0, 0]]], "name": "summary_activations"}, {"class_name": "Merge", "config": {"name": "study", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]], "name": "study"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "summary", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 999}, "inbound_nodes": [[["summary_activations", 0, 0]]], "name": "summary"}, {"class_name": "Merge", "config": {"name": "raw_score", "concat_axis": -1, "mode_type": "raw", "dot_axes": [1, 1], "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "dot", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["study", 0, 0], ["summary", 0, 0]]], "name": "raw_score"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["raw_score", 0, 0]], "name": "model_1"}}