{"keras_version": "1.2.0", "config": {"input_layers": [["left token input", 0, 0], ["target token input", 0, 0], ["right token input", 0, 0], ["other feature inputs", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "left token input"}, "inbound_nodes": [], "name": "left token input", "class_name": "InputLayer"}, {"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "right token input"}, "inbound_nodes": [], "name": "right token input", "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 1], "input_dtype": "int32", "input_length": 1, "activity_regularizer": null, "mask_zero": false, "name": "embedding_5", "W_constraint": null, "dropout": 0.0, "input_dim": 10000, "init": "uniform", "W_regularizer": null, "output_dim": 200, "trainable": true}, "inbound_nodes": [[["left token input", 0, 0]]], "name": "embedding_5", "class_name": "Embedding"}, {"config": {"batch_input_shape": [null, 1], "input_dtype": "int32", "input_length": 1, "activity_regularizer": null, "mask_zero": false, "name": "embedding_6", "W_constraint": null, "dropout": 0.0, "input_dim": 10000, "init": "uniform", "W_regularizer": null, "output_dim": 200, "trainable": true}, "inbound_nodes": [[["right token input", 0, 0]]], "name": "embedding_6", "class_name": "Embedding"}, {"config": {"trainable": true, "name": "left token embedding"}, "inbound_nodes": [[["embedding_5", 0, 0]]], "name": "left token embedding", "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "target token input"}, "inbound_nodes": [], "name": "target token input", "class_name": "InputLayer"}, {"config": {"trainable": true, "name": "right token embedding"}, "inbound_nodes": [[["embedding_6", 0, 0]]], "name": "right token embedding", "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 3], "name": "other feature inputs"}, "inbound_nodes": [], "name": "other feature inputs", "class_name": "InputLayer"}, {"config": {"dot_axes": -1, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "arguments": {}, "mode": "concat", "output_shape_type": "raw", "concat_axis": 1, "name": "merge_3", "mode_type": "raw"}, "inbound_nodes": [[["left token embedding", 0, 0], ["target token input", 0, 0], ["right token embedding", 0, 0], ["other feature inputs", 0, 0]]], "name": "merge_3", "class_name": "Merge"}, {"config": {"activation": "relu", "activity_regularizer": null, "bias": true, "name": "hidden 1", "W_constraint": null, "input_dim": 404, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 128, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "hidden 1", "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "bias": true, "name": "hidden 2", "W_constraint": null, "input_dim": 128, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 64, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["hidden 1", 0, 0]]], "name": "hidden 2", "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "bias": true, "name": "prediction", "W_constraint": null, "input_dim": 64, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "trainable": true, "b_regularizer": null}, "inbound_nodes": [[["hidden 2", 0, 0]]], "name": "prediction", "class_name": "Dense"}], "name": "model_3", "output_layers": [["prediction", 0, 0]]}, "class_name": "Model"}