{"config": {"name": "model_6", "layers": [{"name": "left token input", "inbound_nodes": [], "config": {"name": "left token input", "input_dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer"}, {"name": "right token input", "inbound_nodes": [], "config": {"name": "right token input", "input_dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer"}, {"name": "embedding_11", "inbound_nodes": [[["left token input", 0, 0]]], "config": {"batch_input_shape": [null, 1], "W_constraint": null, "init": "uniform", "output_dim": 200, "mask_zero": false, "activity_regularizer": null, "name": "embedding_11", "input_dtype": "int32", "dropout": 0.0, "input_dim": 10000, "trainable": true, "W_regularizer": null, "input_length": 1}, "class_name": "Embedding"}, {"name": "embedding_12", "inbound_nodes": [[["right token input", 0, 0]]], "config": {"batch_input_shape": [null, 1], "W_constraint": null, "init": "uniform", "output_dim": 200, "mask_zero": false, "activity_regularizer": null, "name": "embedding_12", "input_dtype": "int32", "dropout": 0.0, "input_dim": 10000, "trainable": true, "W_regularizer": null, "input_length": 1}, "class_name": "Embedding"}, {"name": "left token embedding", "inbound_nodes": [[["embedding_11", 0, 0]]], "config": {"name": "left token embedding", "trainable": true}, "class_name": "Flatten"}, {"name": "target token input", "inbound_nodes": [], "config": {"name": "target token input", "input_dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer"}, {"name": "right token embedding", "inbound_nodes": [[["embedding_12", 0, 0]]], "config": {"name": "right token embedding", "trainable": true}, "class_name": "Flatten"}, {"name": "left PoS input", "inbound_nodes": [], "config": {"name": "left PoS input", "input_dtype": "float32", "batch_input_shape": [null, 56], "sparse": false}, "class_name": "InputLayer"}, {"name": "right PoS input", "inbound_nodes": [], "config": {"name": "right PoS input", "input_dtype": "float32", "batch_input_shape": [null, 56], "sparse": false}, "class_name": "InputLayer"}, {"name": "other feature inputs", "inbound_nodes": [], "config": {"name": "other feature inputs", "input_dtype": "float32", "batch_input_shape": [null, 4], "sparse": false}, "class_name": "InputLayer"}, {"name": "merge_6", "inbound_nodes": [[["left token embedding", 0, 0], ["target token input", 0, 0], ["right token embedding", 0, 0], ["left PoS input", 0, 0], ["right PoS input", 0, 0], ["other feature inputs", 0, 0]]], "config": {"name": "merge_6", "concat_axis": 1, "mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "mode": "concat", "output_mask": null, "arguments": {}, "dot_axes": -1, "output_mask_type": "raw"}, "class_name": "Merge"}, {"name": "hidden 1", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"b_constraint": null, "W_constraint": null, "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "name": "hidden 1", "bias": true, "trainable": true, "init": "glorot_uniform", "input_dim": 517, "W_regularizer": null, "output_dim": 128}, "class_name": "Dense"}, {"name": "hidden 2", "inbound_nodes": [[["hidden 1", 0, 0]]], "config": {"b_constraint": null, "W_constraint": null, "activation": "relu", "b_regularizer": null, "activity_regularizer": null, "name": "hidden 2", "bias": true, "trainable": true, "init": "glorot_uniform", "input_dim": 128, "W_regularizer": null, "output_dim": 64}, "class_name": "Dense"}, {"name": "prediction", "inbound_nodes": [[["hidden 2", 0, 0]]], "config": {"b_constraint": null, "W_constraint": null, "activation": "sigmoid", "b_regularizer": null, "activity_regularizer": null, "name": "prediction", "bias": true, "trainable": true, "init": "glorot_uniform", "input_dim": 64, "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "input_layers": [["left token input", 0, 0], ["left PoS input", 0, 0], ["target token input", 0, 0], ["right token input", 0, 0], ["right PoS input", 0, 0], ["other feature inputs", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.0"}