{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "left_token_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "left_token_input"}, "inbound_nodes": []}, {"name": "right_token_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "right_token_input"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 10000, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["left_token_input", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 10000, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["right_token_input", 0, 0, {}]]]}, {"name": "left_token_embedding", "class_name": "Flatten", "config": {"name": "left_token_embedding", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "target_token_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "target_token_input"}, "inbound_nodes": []}, {"name": "right_token_embedding", "class_name": "Flatten", "config": {"name": "right_token_embedding", "trainable": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "left_PoS_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 56], "dtype": "float32", "sparse": false, "name": "left_PoS_input"}, "inbound_nodes": []}, {"name": "right_PoS_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 56], "dtype": "float32", "sparse": false, "name": "right_PoS_input"}, "inbound_nodes": []}, {"name": "other_feature_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "other_feature_inputs"}, "inbound_nodes": []}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "mode_type": "raw", "concat_axis": 1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["left_token_embedding", 0, 0, {"mask": [null, null, null, null, null, null]}], ["target_token_input", 0, 0, {"mask": [null, null, null, null, null, null]}], ["right_token_embedding", 0, 0, {"mask": [null, null, null, null, null, null]}], ["left_PoS_input", 0, 0, {"mask": [null, null, null, null, null, null]}], ["right_PoS_input", 0, 0, {"mask": [null, null, null, null, null, null]}], ["other_feature_inputs", 0, 0, {"mask": [null, null, null, null, null, null]}]]]}, {"name": "hidden1", "class_name": "Dense", "config": {"name": "hidden1", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "hidden2", "class_name": "Dense", "config": {"name": "hidden2", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden1", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden2", 0, 0, {}]]]}], "input_layers": [["left_token_input", 0, 0], ["left_PoS_input", 0, 0], ["target_token_input", 0, 0], ["right_token_input", 0, 0], ["right_PoS_input", 0, 0], ["other_feature_inputs", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}