{"keras_version": "1.2.0", "config": {"input_layers": [["left token input", 0, 0], ["target token input", 0, 0], ["right token input", 0, 0], ["other feature inputs", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 1], "sparse": false, "input_dtype": "float32", "name": "left token input"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "left token input"}, {"config": {"batch_input_shape": [null, 1], "sparse": false, "input_dtype": "float32", "name": "right token input"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "right token input"}, {"config": {"W_regularizer": null, "input_dim": 10000, "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 1], "activity_regularizer": null, "output_dim": 200, "init": "uniform", "trainable": true, "W_constraint": null, "dropout": 0.0, "input_length": 1, "name": "embedding_3"}, "class_name": "Embedding", "inbound_nodes": [[["left token input", 0, 0]]], "name": "embedding_3"}, {"config": {"W_regularizer": null, "input_dim": 10000, "mask_zero": false, "input_dtype": "int32", "batch_input_shape": [null, 1], "activity_regularizer": null, "output_dim": 200, "init": "uniform", "trainable": true, "W_constraint": null, "dropout": 0.0, "input_length": 1, "name": "embedding_4"}, "class_name": "Embedding", "inbound_nodes": [[["right token input", 0, 0]]], "name": "embedding_4"}, {"config": {"trainable": true, "name": "left token embedding"}, "class_name": "Flatten", "inbound_nodes": [[["embedding_3", 0, 0]]], "name": "left token embedding"}, {"config": {"batch_input_shape": [null, 1], "sparse": false, "input_dtype": "float32", "name": "target token input"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "target token input"}, {"config": {"trainable": true, "name": "right token embedding"}, "class_name": "Flatten", "inbound_nodes": [[["embedding_4", 0, 0]]], "name": "right token embedding"}, {"config": {"batch_input_shape": [null, 1], "sparse": false, "input_dtype": "float32", "name": "other feature inputs"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "other feature inputs"}, {"config": {"mode": "concat", "dot_axes": -1, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "arguments": {}, "concat_axis": 1, "output_shape": null, "name": "merge_2"}, "class_name": "Merge", "inbound_nodes": [[["left token embedding", 0, 0], ["target token input", 0, 0], ["right token embedding", 0, 0], ["other feature inputs", 0, 0]]], "name": "merge_2"}, {"config": {"W_regularizer": null, "input_dim": 402, "bias": true, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 128, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "relu", "name": "hidden 1"}, "class_name": "Dense", "inbound_nodes": [[["merge_2", 0, 0]]], "name": "hidden 1"}, {"config": {"W_regularizer": null, "input_dim": 128, "bias": true, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 64, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "relu", "name": "hidden 2"}, "class_name": "Dense", "inbound_nodes": [[["hidden 1", 0, 0]]], "name": "hidden 2"}, {"config": {"W_regularizer": null, "input_dim": 64, "bias": true, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "sigmoid", "name": "prediction"}, "class_name": "Dense", "inbound_nodes": [[["hidden 2", 0, 0]]], "name": "prediction"}], "output_layers": [["prediction", 0, 0]], "name": "model_2"}, "class_name": "Model"}